// import 'package:event_bus/event_bus.dart';
//
// EventBus eventBus = EventBus();
//
// /// socket 通知类
// class SocketEvent {
//   // cmd=7（管理员邀请成员入群）
//   // cmd=9（群成员被邀请加入某个群）
//   // cmd=10（群成员被移出群）
//   // cmd=11（单聊/群聊消息）
//   // cmd=13（心跳包）
//   // cmd=16（删除消息）
//   // cmd=6（ws登录反馈）
//   // cmd=24（有人添加我好友）
//   // cmd=25（删除好友）
//   // cmd=23（群操作事件）
//   // cmd=21（解散群）
//   // cmd=22（新建入群）
//   // cmd=29（远程销毁所有消a息（群））
//   // cmd=30（远程销毁所有消息（好友））
//   // cmd=33（接收命令好友 是否在线 群组有多少人在线）
//   // cmd=18（好友信息和群信息）
//   // cmd=31（异地登陆）
//   // cmd=28（消息已读回执）
//   // cmd=34（消息编辑）
//   // cmd=35（系统通知）
//   // cmd=36（新设备登录验证）
//   // cmd=38（清空所有消息）
//   // cmd=39（置顶消息）
//   // cmd=40（后台修改敏感词）
//   // cmd=41（意见反馈 系统通知）
//   // cmd=42（清除本地缓存）
//   // cmd=43（其他端更新了gif图片）
//   // cmd=44（多端同步删除系统通知消息）
//   // cmd=45（多端同步删除群申请通知消息）
//   // cmd=46（多端同步个人信息 头像 名字改变）
//   // cmd=47（系统通知消息未读数量）
//   // cmd=48（好友信息修改）
//   // cmd=50（删除会话 ws 推送）
//   // cmd=51（发送 标记会话 ws 已读/未读）
//   // cmd=52（接收 标记会话 ws 已读/未读）
//   // cmd=55（彩票游戏 群设置）
//   int cmd;
//
//   SocketEvent(this.cmd);
// }
